In [77]:
import pandas as pd
import numpy as np

I want to explore some data. Let's use data about Tourism and Economic Impact Dataset that is available here: https://www.kaggle.com/datasets/bushraqurban/tourism-and-economic-impact
I've downloaded it into data folder

In [21]:
df = pd.read_csv('data/world_tourism_economy_data.csv')
df.head(10)

,country,country_code,year,tourism_receipts,tourism_arrivals,tourism_exports,tourism_departures,tourism_expenditures,gdp,inflation,unemployment
0,Aruba,ABW,1999,7.820000e+08,9.720000e+05,62.542949,NaN,9.495387,1.722905e+09,2.280372,NaN
1,Africa Eastern and Southern,AFE,1999,8.034209e+09,1.530938e+07,12.204030,NaN,7.760536,2.654293e+11,7.819865,NaN
2,Afghanistan,AFG,1999,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Africa Western and Central,AFW,1999,1.443613e+09,3.897975e+06,3.974476,NaN,6.147291,1.394683e+11,0.372266,NaN
4,Angola,AGO,1999,3.100000e+07,4.500000e+04,0.583858,NaN,2.489638,6.152923e+09,248.195902,NaN
5,Albania,ALB,1999,2.180000e+08,3.710000e+05,55.969191,NaN,3.699007,3.212122e+09,0.389438,18.40
6,Andorra,AND,1999,NaN,9.422000e+06,NaN,NaN,NaN,1.240295e+09,NaN,NaN
7,Arab World,ARB,1999,NaN,NaN,NaN,NaN,NaN,6.654154e+11,2.669374,NaN
8,United Arab Emirates,ARE,1999,8.930000e+08,NaN,NaN,NaN,NaN,8.444547e+10,NaN,NaN
9,Argentina,ARG,1999,3.175000e+09,2.898000e+06,11.340372,NaN,15.889092,2.835230e+11,NaN,14.05

I want to visualize some data. Let's plot country name along with gdp and tourism receipts. Next I want to plot how much % of gdp consists of tourism

But to do that I need to learn basic of matplotlib

In [31]:
tdf = df[df.country != 'World']
tdf[['country', 'gdp', 'tourism_receipts']].sort_values(by='gdp', ascending=False).head(30)

                        country           gdp  tourism_receipts
6479                High income  6.827649e+13               NaN
6213                High income  6.496126e+13               NaN
6565               OECD members  6.474656e+13               NaN
5947                High income  6.273789e+13               NaN
6299               OECD members  6.069133e+13               NaN
6582  Post-demographic dividend  6.048525e+13               NaN
6033               OECD members  5.916960e+13               NaN
5415                High income  5.735101e+13      1.152147e+12
6316  Post-demographic dividend  5.706675e+13               NaN
5149                High income  5.679396e+13      1.147991e+12
5681                High income  5.594626e+13               NaN
6050  Post-demographic dividend  5.582887e+13               NaN
5501               OECD members  5.417948e+13      9.970637e+11
5235               OECD members  5.363177e+13      9.843060e+11
4883                High income  5.344317e+13      1.059775e+12
4085                High income  5.342493e+13      9.962883e+11
5767               OECD members  5.300081e+13               NaN
3819                High income  5.254570e+13      9.379659e+11
3553                High income  5.180355e+13      8.715600e+11
3287                High income  5.163766e+13      8.371418e+11
5518  Post-demographic dividend  5.113489e+13      1.000793e+12
4617                High income  5.084086e+13      9.897030e+11
4969               OECD members  5.071204e+13      9.075713e+11
5252  Post-demographic dividend  5.059812e+13      1.011619e+12
4171               OECD members  5.049938e+13      8.604182e+11
5784  Post-demographic dividend  5.014084e+13               NaN
4351                High income  4.987550e+13      9.695818e+11
3905               OECD members  4.946458e+13      8.109309e+11
3373               OECD members  4.883293e+13      7.359993e+11
3639               OECD members  4.876943e+13      7.549178e+11

There are many rows with country value which's not a country. I want to fix it using some file with all countries in the world.

I want to turn country list into convenient csv file, and then into pandas dataframe

In [32]:
with open('data/all_countries_in_the_world.txt') as src, open('data/all_countries_in_the_world.csv', 'w') as dest:
    for line in src:
        stripped_line = line.strip()
        if stripped_line:
            dest.write(stripped_line + ',')
countries = pd.read_csv('data/all_countries_in_the_world.csv')

In [34]:
countries

Empty DataFrame
Columns: [Afghanistan, Albania, Algeria, Andorra, Angola, Antigua and Barbuda, Argentina, Armenia, Australia, Austria, Azerbaijan, The Bahamas, Bahrain, Bangladesh, Barbados, Belarus, Belgium, Belize, Benin, Bhutan, Bolivia, Bosnia and Herzegovina, Botswana, Brazil, Brunei, Bulgaria, Burkina Faso, Burundi, Cambodia, Cameroon, Canada, Cape Verde, Central African Republic, Chad, Chile, China, Colombia, Comoros, Congo,  Republic of the, Congo.1,  Democratic Republic of the, Costa Rica, Cote d'Ivoire, Croatia, Cuba, Cyprus, Czech Republic, Denmark, Djibouti, Dominica, Dominican Republic, East Timor (Timor-Leste), Ecuador, Egypt, El Salvador, Equatorial Guinea, Eritrea, Estonia, Ethiopia, Fiji, Finland, France, Gabon, The Gambia, Georgia, Germany, Ghana, Greece, Grenada, Guatemala, Guinea, Guinea-Bissau, Guyana, Haiti, Honduras, Hungary, Iceland, India, Indonesia, Iran, Iraq, Ireland, Israel, Italy, Jamaica, Japan, Jordan, Kazakhstan, Kenya, Kiribati, Korea,  North, Korea.1,  South, Kosovo, Kuwait, Kyrgyzstan, Laos, Latvia, ...]
Index: []

[0 rows x 202 columns]

consider only those years where's data about tourism receipts

In [133]:
dtoplt = df[['country', 'gdp', 'tourism_receipts', 'year']] #data to plot
dtoplt = dtoplt[
    (dtoplt['country'].isin(countries)) &
    (dtoplt['tourism_receipts'].notna())
].sort_values(by='gdp', ascending=False)
dtoplt[dtoplt['gdp'].isna()]

          country  gdp  tourism_receipts  year
4591      Eritrea  NaN        48000000.0  2016
4738  South Sudan  NaN        23500000.0  2016
5004  South Sudan  NaN        26000000.0  2017
5270  South Sudan  NaN        12000000.0  2018

Handle NaN gdp values. Let's put into it gdp from a year before

In [142]:
#find other rows and take that with year closest to year of row where we have NaN gdp
#i know that this code is ugly i'm so sorry :"(
not_nan_eritreas = dtoplt.loc[(dtoplt['country'] == 'Eritrea') & (dtoplt['year'] != 2016)]
nan_eritrea = dtoplt[(dtoplt['gdp'].isna()) & (dtoplt['country'] == 'Eritrea')]
min

np.int64(5)